<?php
/**
*
* @package Icy Phoenix
* @version $Id$
* @copyright (c) 2008 Icy Phoenix
* @license http://opensource.org/licenses/gpl-license.php GNU Public License
*
*/
/* translation
                           
   Переведено на русский: Мельников Николай(zver) zver64ru@gmail.com  Icq:45716497 WWW.SARPORT.RU
It is translated into Russian: Mel'nikov Nikolay(zver)   zver64ru@gmail.com  Icq:45716497 WWW.SARPORT.RU
                    
   */
/**
*
* @Extra credits for this file
* Dimitri Seitz (dwing@weingarten-net.de)
* Lopalong
*
*/

if (!defined('IN_ICYPHOENIX'))
{
	exit;
}

//
// To add an entry to your rules simply add a line to this file in this format:
// $faq[] = array("question", "answer");
// If you want to separate a section enter $faq[] = array("--","Block heading goes here if wanted");
// Links will be created automatically
//
// DO NOT forget the ; at the end of the line.
// Do NOT put double quotes (") in your rules entries, if you absolutely must then escape them ie. \"something\"
// The rules items will appear on the rules page in the same order they are listed in this file

$faq[] = array('--', 'Icy Phoenix Основные правила :');
$faq [] = array ('Пожалуйста читайте следующие правила и рекомендации, переходя к посту на форуме, Вы соглашаетесь на эти рекомендации и должны повиноваться им всегда. Это руководство проектировано, чтобы нажать равновесие между основной целью Ледяного вебсайта Финикса, предоставляя информацию и поддержкой, и сохраняя ослабленную и радушную атмосферу Ледяного Финикса. Мы требуем, чтобы все посты были позитивны, конструктивны, и на теме. Мы резервируем право удалить любые темы или индивидуальные посты, которые мы считаем несоответствующим или подрывным. Пожалуйста отметьте, что, время от времени, темы могут быть удалены для того, чтобы быть несоответствующими даже при том, что Ваш индивидуальный пост в той теме, возможно, прекрасно подошел. Вы не можете сделать личные атаки на других пользователей или на форумах или на частных сообщениях. Вы не можете использовать profanity:-, это является непрофессиональным и наступательным, и не будет допускаться. Вы не можете рекламировать или продвигаете другие компании или их программы в этом вебсайте. Мы резервируем право запретить любого участника, который нарушает наши рекомендации или разрушает форум. Мы будем справедливы и обеспечим предупреждение в большинстве случаев. Если у Вас есть проблема относительно наших служб, политики, или штата, пожалуйста используйте личный ответственный метод, такой как частное сообщение или электронная почта администратору или модератору - они подсвечены в списке активных членов. Мы принимаем серьезные жалобы близко к сердцу и приложим все усилия, чтобы обратиться к ним. ');
$faq [] = array ('Профанация', '1. Не будет никакого злоупотребления профанацией. Любой чрезмерный неуместный язык будет удален, и Вы получите конечное предупреждение.');
$faq [] = array ('Личные Дискриминации', '2. Там будет не расовым, этническим, пол базировал оскорбления или любые другие формы личной дискриминации. ');
$faq [] = array ('Наступательный или Подстрекательский', '3. Не будет никаких постов, предназначенных, чтобы оскорбить или причинить любому другому участнику боль, способом, который является наступательным или подстрекательским.');
$faq [] = array ('Спаминг', '4. Спаминг не разрешен; пожалуйста останьтесь на всех своих постах, настолько конструктивных насколько возможно.');
$faq [] = array ('Порнография', '5. Порнографические изображения, пиратское программное обеспечение, или любые другие незаконные транзакции НЕ могут быть связаны ни в какой форме или форме.');
$faq [] = array ('Почтовое Свойство', '6. Все посты - свойство автора. Этот форум и все вебсайты, принадлежавшие вместе с этим форумом, имеют право просить чередование или удаление любого наступательного поста. Посты могут быть удалены по любым причинам, которые администраторы форума считают разумным.');
$faq [] = array ('Изображения', '7. Изображения могут быть зарегистрированы, пока они не сексуально явные или наступательными. Если Вы планируете перенести больше чем одно изображение, или тема основана на графике, пожалуйста свяжите изображения вместо того, чтобы показать на экране их. ');
$faq [] = array ('Сигнатуры', '8. Сигнатуры могут содержать изображения, но, возможно, не немного больше чем 300x100; 468x60 заголовки также разрешены (в пределах причины - они не должны быть должны рекламировать продукт компании). Если Ваша сигнатура будет большей чем выделенный размер, который, данный или считает недопустимым штат, то Вас будет требовать модератор изменить размеры или изменить Ваше изображение. Пожалуйста также попробуйте и сохраните текстовые сигнатуры под 5 строками. Неудача выполнить модератор \запрос приведет к удалению Вашей сигнатуры. ');
$faq [] = array ('Реклама', '9. Рекламе коммерчески связанных продуктов запрещают в любом отношении к Вашей учетной записи.');
$faq [] = array ('Правильная область, чтобы перенести', '10. Не забудьте переносить в правильной области. Не торопитесь, чтобы смотреть на другие темы, чтобы видеть, куда Ваша тема должна пойти. Если Ваша тема будет помещена на неправильном форуме, то она будет перемещена модератором. Если тема распознана как зарегистрированный на неправильном форуме, или если пост - нарушение наших рекомендаций, тогда пожалуйста войдите в контакт с модератором или через ПОПОЛУДНИ или "пост отчета к модератору" особенность; пожалуйста публично не отвечайте на участника.');
$faq [] = array ('Олицетворение', '11. Любое олицетворение пользователя от этих форумов, в любом режиме коммуникации, строго запрещено и приведет к запрету.');
$faq [] = array ('Внешнее Информационное наполнение', '12. Если Вы связываетесь с внешним информационным наполнением, Вы должны связаться непосредственно с тем информационным наполнением. Недопустимо использовать ссылку - через системы, чтобы замаскировать происходящий URL, и случаи, где это, как находят, случается, могут быть отредактированы или удалены как соответствующие.');
$faq [] = array ('Нарушение', '13. Нарушение любого из этих правил приведет к последствиям, определенным в зависимости от конкретного случая.');
$faq [] = array ('Спасибо', 'Ледяная Группа Финикса');

?>