<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta http-equiv="content-style-type" content="text/css" />
	<meta name="author" content="Icy Phoenix Team" />

	<link rel="stylesheet" href="../templates/common/acp.css" type="text/css" />
	<link rel="shortcut icon" href="../images/favicon.ico" />

	<title>Icy Phoenix :: Leeme</title>

	<script type="text/javascript" src="../templates/common/js/ip_scripts.js"></script>
	<!--[if lt IE 7]>
	<script type="text/javascript" src="../templates/common/js/pngfix.js"></script>
	<![endif]-->
</head>
<body>
<a name="top"></a>
<div id="global-wrapper" style="width: 960px; clear: both; margin: 0 auto;">
<div class="leftshadow"><div class="rightshadow"><div id="wrapper-inner">
<table id="forumtable" width="100%" cellspacing="0" cellpadding="0">
<tr>
	<td width="100%" colspan="3" valign="top">
	<div id="top_logo">
	<table class="" width="100%" cellspacing="0" cellpadding="0" border="0">
	<tr>
	<td height="150" align="left" valign="middle">
		<a href="http://www.icyphoenix.com" title="Icy Phoenix"><img src="../images/logo_ip.png" alt="Icy Phoenix" title="Icy Phoenix" border="0" /></a>
	</td>
	</tr>
	</table>
	</div>
	</td>
</tr>
<tr><td colspan="3" class="forum-buttons" valign="middle">Instrucciones para Icy Phoenix en Castellano</td></tr>
<tr>
	<td colspan="3" id="content">

<!-- CONTENT BEGIN -->
		<table cellspacing="0" cellpadding="0" width="100%" class="forumline">
		<tr><td class="row-header" colspan="3"><span>Icy Phoenix 1.3</span></td></tr>
		<tr><th><span>Tabla de contenidos</span></th></tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
				<ul class="post-name">
					<li><a href="#overview">Introducci&oacute;n</a></li>
					<li><a href="#license">Licencia</a></li>
					<li><a href="#requirements">Requisitos</a></li>
					<li><a href="#fresh_installation">Instalaci&oacute;n nueva</a></li>
					<li><a href="#upgrade_phpbb">Actualizaci&oacute;n desde phpBB 2.0.x</a></li>
					<li><a href="#upgrade_xs">Actualizaci&oacute;n desde phpBB XS</a></li>
					<li><a href="#upgrade_ip_015">Actualizaci&oacute;n desde IP 1.1.0.15</a></li>
					<li><a href="#upgrade_ip">Actualizaci&oacute;n desde IP 1.2.0.27 o superior</a></li>
					<li><a href="#support">Soporte</a></li>
					<li><a href="#history">Historial</a></li>
				</ul>
				</div>
			</td>
		</tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="overview">Introducci&oacute;n</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<br />
				<div class="post-text">
					<ul>
						<li><span style="color: #00AA00;"><b>&iquest;Qu&eacute; es Icy Phoenix?</b></span><br /></li>
						<li><span style="color: #0000AA;">Icy Phoenix es un CMS basado en phpBB (un paquete altamente modificado en c&oacute;digo libre y escrito en  PHP), con muchas modificaciones e integraciones de c&oacute;digo que ofrecen una mayor flexibilidad al paquete entero. La p&aacute;gina web oficial de phpBB es <a class="post-url" href="http://www.phpbb.com/" target="_blank">www.phpbb.com</a>. Icy Phoenix  tiene algunas caracter&iacute;sticas desarrolladas originalmente por el <acronym title="phpBB eXpertS">Proyecto phpBB XS,</acronym> que fue fundado por Bicet y desarrollado por Bicet y Mighty Gorgon. Icy Phoenix ha sido creado por <a class="post-url" href="http://www.mightygorgon.com/" target="_blank">Mighty Gorgon</a> despu&eacute;s de abandonar el <acronym title="phpBB eXpertS">Proyecto phpBB XS</acronym>.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Cu&aacute;les son las caracter&iacute;sticas principales de Icy Phoenix?</b></span><br /></li>
						<li>
							<span style="color: #0000AA;">Icy Phoenix tiene muchas caracter&iacute;sticas -la mayor parte de ellas se citan en los <a class="post-url" href="http://www.icyphoenix.com/credits.php">Cr&eacute;ditos</a> de &eacute;sta web-, pero las principales son:</span><br />
							<ul>
								<li><span style="color: #0000AA;">&Iacute;ndice de foros phpBB y sistema de permisos</span><br /></li>
								<li><span style="color: #0000AA;">La caracter&iacute;stica CMS permite la creaci&oacute;n de nuevas p&aacute;ginas y bloques (algunas de las funciones est&aacute;n basadas en el proyecto abandonado de IM Portal)</span><br /></li>
								<li><span style="color: #0000AA;">Integraci&oacute;n total de la plantilla en todas las secciones de la web</span><br /></li>
								<li><span style="color: #0000AA;">Muchas utilidades disponibles: &aacute;lbum, Descargas, Biblioteca, Enlaces, Chat...</span><br /></li>
								<li><span style="color: #0000AA;">M&uacute;ltiples lenguajes y plantillas para utilizar</span><br /></li>
								<li><span style="color: #0000AA;">Est&aacute; casi adaptado al 100% en XHTML y CSS W3C</span><br /></li>
								<li><span style="color: #0000AA;">...y muchas otras.</span><br /></li>
							</ul>
							<br /><br />
						</li>
						<li><span style="color: #00AA00;"><b>&iquest;Icy Phoenix dar&aacute; soporte a los Bugs (errores de programaci&oacute;n), errores de seguridad y mejoras?</b></span><br /></li>
						<li><span style="color: #0000AA;">Icy Phoenix es un proyecto de c&oacute;digo libre. Por lo tanto,  est&aacute; desarrollado por gente que invierte parte de su tiempo libre en &eacute;l. En este momento hay varias personas en el equipo del Proyecto que ayudan y contribuyen a mejorarlo. Esperamos que la comunidad continue creciendo y pudiendo proporcionar toda la ayuda necesaria a los usuarios que lo necesiten.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Icy Phoenix es f&aacute;cil de instalar y actualizar desde otros sistemas y plataformas?</b></span><br /></li>
						<li><span style="color: #0000AA;">Icy Phoenix tiene sus propios documentos que informan a los usuarios qu&eacute; pasos han de seguir en el proceso de instalaci&oacute;n. Tambi&eacute;n se facilita un archivo para actualizar el sistema desde phpBB est&aacute;ndar y desde <acronym title="Antecesor de Icy">phpBB XS</acronym>. Esperamos a&ntilde;adir en el futuro  alg&uacute;n procedimiento de actualizaci&oacute;n desde otras plataformas. Actualmente, la &uacute;nica forma de actualizar desde otros sistemas modificados es volviendo a phpBB est&aacute;ndar (ya se ha redactado el procedimiento para esto), y realizar   luego  el procedimiento de actualizaci&oacute;n desde phpBB.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Icy Phoenix tiene muchas plantillas?</b></span><br /></li>
						<li><span style="color: #0000AA;">S&iacute;. En este momento hay algunas plantillas disponibles (algunas de ellas con variaciones de colores) y estamos trabajando para crear nuevas. Si est&aacute; interesado en las nuevas plantillas, tendr&aacute; que revisar regularmente el <a class="post-url" href="http://www.icyphoenix.com/" target="_blank">foro de soporte</a>.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Icy Phoenix tiene m&uacute;ltiples lenguajes?</b></span><br /></li>
						<li><span style="color: #0000AA;">El Ingl&eacute;s es el lenguaje principal de Icy Phoenix, pero ha sido traducido a otros lenguajes, como (en orden alfab&eacute;tico) Alem&aacute;n,  Catal&aacute;n, Espa&ntilde;ol, Gallego, Holand&eacute;s, Italiano, Serbio... Pr&oacute;ximamente ir&aacute;n apareciendo nuevas traducciones.  Si no ha encontrado su lenguaje en la lista anterior, por favor, pregunte en el <a class="post-url" href="http://www.icyphoenix.com/" target="_blank">foro de soporte</a>: es posible  que alguien est&eacute; trabajando en la traducci&oacute;n que necesita, y pueda usted a&ntilde;adirse al equipo de traducci&oacute;n para contribuir a &eacute;l.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Icy Phoenix ser&aacute; actualizado a phpBB 3?</b></span><br /></li>
						<li><span style="color: #0000AA;">En este momento no hay  intenci&oacute;n de actualizar  Icy Phoenix a phpBB 3. Hay varias razones para esto. Por supuesto, cuando phpBB 3 sea liberado, las cosas pueden cambiar.</span><br /><br /></li>
						<li><span style="color: #00AA00;"><b>&iquest;Puedo entrar al Proyecto Icy Phoenix?</b></span><br /></li>
						<li><span style="color: #0000AA;">Por supuesto. Icy Phoenix es un proyecto de c&oacute;digo libre, y cualquier persona que est&eacute; dispuesta a contribuir de una forma estable puede entrar en el equipo.</span><br /><br /></li>
					</ul>
					<br />
				</div>
				<br />
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="license">Licencia</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<br />
				<div class="post-text">
					<b>Icy Phoenix</b> ha sido creado por Mighty Gorgon. Es un CMS basado en phpBB, est&aacute; muy modificado, con muchos MODs y algunas caracter&iacute;sticas codificadas por Mighty Gorgon y el Equipo de Icy Phoenix. Como phpBB est&aacute; bajo la licencia GNU,  Icy Phoenix tambi&eacute;n est&aacute; bajo esa  licencia GNU (puede leer los t&eacute;rminos aqu&iacute;: <a class="post-url" href="http://www.icyphoenix.com/docs/COPYING" target="_blank">GNU</a>).<br /><br />
					Los cr&eacute;ditos de todos los MODs incluidos y sus autores se pueden encontrar en el siguiente enlace: <a class="post-url" href="http://www.icyphoenix.com/credits.php" target="_blank">Cr&eacute;ditos</a>.<br /><br />
					phpBB &copy; 2009 <a class="post-url" href="http://www.phpbb.com/" target="_blank">phpBB Group</a>.<br />
					Icy Phoenix &copy; 2009 <a class="post-url" href="http://www.icyphoenix.com/" target="_blank">Equipo de Icy Phoenix</a>.
				</div>
				<br />
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="requirements">Requisitos</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					Antes de instalar Icy Phoenix debe asegurarse de que tiene los requisitos <b>TOTALMENTE NECESARIOS</b> en su servidor:
					<ul>
						<li>Al menos 20 MB de espacio libre en el directorio en que quiere instalar el sistema.</li>
						<li>Servidor web con PHP (4 o superior, mejor si es 5.x o superior) instalado y funcionando (funciona mejor con Linux + Apache)</li>
						<li>Base de Datos MySQL (3 o superior, mejor si es 5.x o superior) con 1 MB de espacio libre como m&iacute;nimo (por supuesto que el espacio que necesitar&aacute; depender&aacute; de lo grande que sea su p&aacute;gina web... 1 MB es para la instalaci&oacute;n b&aacute;sica limpia).</li>
						<li>Capacidad de aplicar permisos CHMOD.</li>
					</ul>
					<br /><br />
					Otros requisitos  que se sugieren para el &oacute;ptimo funcionamiento de Icy Phoenix (aunque  no son estrictamente necesarios):
					<ul>
						<li>Servidor web con capacidad para soportar archivos .htaccess.</li>
						<li>Apache Rewrite Mod instalado y funcionando.</li>
						<li>Librerias GD (al menos 2.0.28) instaladas y funcionando.</li>
						<li>Registros Globales fijados en OFF (deshabilitados).</li>
					</ul>
				</div>
				<br />
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="fresh_installation">Instalaci&oacute;n Nueva</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					<ol type="1">
						<li>Descomprimir el paquete de Icy Phoenix en un directorio de su disco duro.</li>
						<li>Copie todos los archivos de Icy Phoenix en un directorio de su servidor web (ej: /icyphoenix/).</li>
						<li>
							Aplique los permisos <span class="text_red">CHMOD 777</span> a los siguientes archivos y directorios:<br />
							<ul>
							<li><b>backup/</b></li>
							<li><b>cache/</b></li>
                            <li><b>cache/cms/</b></li>
							<li><b>cache/forums/</b></li>
							<li><b>cache/posts/</b></li>
							<li><b>cache/sql/</b></li>
							<li><b>cache/topics/</b></li>
							<li><b>cache/uploads/</b></li>
							<li><b>cache/users/</b></li>
							<li><b>downloads/</b></li>
							<li><b>files/</b></li>
							<li><b>files/album/</b></li>
							<li><b>files/album/cache/</b></li>
							<li><b>files/album/med_cache/</b></li>
							<li><b>files/album/users/</b></li>
							<li><b>files/album/wm_cache/</b></li>
							<li><b>files/posted_images/</b></li>
							<li><b>files/thumbs/</b></li>
							<li><b>images/avatars/</b></li>
							<li><b>logs/</b></li>
							<li><b>logs/logfile_attempt_counter.txt</b></li>
							<li><b>logs/logfile_blocklist.txt</b></li>
							<li><b>logs/logfile_debug_mode.txt</b></li>
							<li><b>logs/logfile_malformed_logins.txt</b></li>
							<li><b>logs/logfile_spammer.txt</b></li>
							<li><b>logs/logfile_worms.txt</b></li>
							<li><b>pafiledb/uploads/</b></li>
							</ul>
							<br />
						</li>
						<!--
						<li>
							Aplique los permisos <span class="text_red">CHMOD 666</span> a los siguientes archivos:<br />
							<ul>
								<li><b>language/lang_*/lang_extend.php</b></li>
							</ul>
							<br />
						</li>
						-->
						<li>Ejecute el archivo de instalaci&oacute;n del directorio /install/: <b>/install/install.php</b> (ej: <a class="post-url" href="http://www.miweb.com/icyphoenix/install/install.php">http://www.miweb.com/icyphoenix/install/install.php</a>)</li>
						<li>Siga todas las instrucciones de la pantalla, llene todos los datos solicitados y termine la instalaci&oacute;n.</li>
						<li>Borre o cambie el nombre al directorio <b>/install/</b>.</li>
						<li>Personalice los archivos que necesiten ser retocados un poco para su sitio:
							<ul>
							<li><b>.htaccess</b>: configuraci&oacute;n b&aacute;sica de su dominio y apache.</li>
							<li><b>robots.txt</b>: cambie la ruta de su mapa del sitio y personalice las reglas b&aacute;sicas para robots.</li>
							<li><b>favicon.ico</b> y <b>images/favicon.ico</b>: personalice el icono de su sitio.</li>
							<li><b>includes/constants.php</b>: personalice algunas constantes y establezca las ID de los administradores del sitio.</li>
							<li><b>language/lang_spanish/lang_main_settings.php</b>: algunos datos importantes sobre usted, su sitio y su configuraci&oacute;n b&aacute;sica.</li>
							<li><b>templates/default/overall_header*.tpl</b>: puede personalizar aqu&iacute; algunas partes de la apariencia de su plantilla (algunas de estas opciones pueden ser cambiadas en el ACP y CMS, as&iacute; qeu no ser&aacute; necesario editar estos archivos).</li>
							</ul>
						</li>
						<li>Personalice las opciones en el ACP y el CMS.</li>
						<li>Disfrute de su nueva web <img src="../images/smiles/icon_mrgreen.gif" alt="" title="Disfrute!" />.</li>
					</ol>
					<br />
				</div>
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="upgrade_phpbb">Actualizaci&oacute;n desde phpBB 2.0.x</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					Si ya est&aacute; utilizando phpBB, puede actualizar f&aacute;cilmente su web siguiendo estas instrucciones:<br />
					<ol type="1">
						<li><strong><font color="#FF1010">Haga una copia de seguridad completa de los archivos y de la base de datos</font></strong> (si no  hace una copia de seguridad, &iexcl;no se atreva  a pedir ayuda luego! <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />)</li>
						<li>&iquest;Ya lo ha copiado todo? Si no ha hecho la copia de seguridad, por favor, vuelva al punto anterior y h&aacute;gala.</li>
						<li>Copie su actual <b>config.php</b> y gu&aacute;rdelo en un sitio seguro.</li>
						<li>Compruebe de nuevo que su copia de seguridad es correcta y est&aacute; guardada en un sitio seguro. <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" /></li>
						<li>Identifiquese como Administrador.</li>
						<li>Descomprima el paquete de Icy Phoenix en un directorio de su disco duro.</li>
						<li>Suba la carpeta <b>install</b> a la ra&iacute;z de su Icy Phoenix, y ejecute el <b>database_update.php</b> (ej: <a class="post-url" href="http://www.miweb.com/foro/install/database_update.php">http://www.miweb.com/foro/install/database_update.php</a>). Por favor recuerde que si la carpeta <b>install/</b> no est&aacute; en la ra&iacute;z de su foro, la actualizaci&oacute;n no funcionar&aacute; correctamente.</li>
						<li>Borre la carpeta <b>install</b>.</li>
						<li>Borre los siguientes directorios (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar del phpBB est&aacute;ndar, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />):
							<ul>
								<li><b>admin/</b></li>
								<li><b>db/</b></li>
								<li><b>includes/</b></li>
								<li><b>language/</b></li>
								<li><b>templates/</b></li>
							</ul>
						</li>
						<li>Borre <b>todos los archivos, </b>pero mantenga el <b>config.php</b> en la ra&iacute;z de su foro (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar del phpBB est&aacute;ndar, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />).</li>
						<li>Suba todos los archivos de Icy Phoenix (pero la copia guardada del <b>config.php</b> subala a su correspondiente sitio) al mismo directorio donde ten&iacute;a instalado y funcionando su phpBB. Compruebe que todos los archivos viejos son sobrescritos, en su caso, por los nuevos.</li>
						<li>Aplique todos los permisos CHMOD listados en la <a class="post-url" href="#fresh_installation">Instalaci&oacute;n Nueva</a>.</li>
						<li>Modifique lo que necesite para personalizar los campos y la base de datos (algunos archivos necesitan ser editados manualmente, pero  la mayor parte de las opciones pueden ser configuradas a trav&eacute;s del ACP y CMS).</li>
						<li>Abra su web.</li>
						<li>Disfrute de su nueva web <b>Icy Phoenix</b> <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Disfrute!" title="Disfrute!" />.</li>
					</ol>
					<br />
				</div>
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="upgrade_xs">Actualizaci&oacute;n desde phpBB XS</a></span></td>
		</tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					Si ya est&aacute; utilizando phpBB XS, puede actualizar su web siguiendo estas instrucciones (basadas en la instalaci&oacute;n est&aacute;ndar de phpBB XS 058):<br />
					<ol type="1">
						<li>Identifiquese como Administrador.</li>
						<li>Cierre su web.</li>
						<li><strong><span class="text_red">Haga una copia de seguridad completa de los archivos y la base de datos</span></strong> (&iexcl;si no  hace una copia de seguridad, no se atreva a pedir ayuda luego! <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />)</li>
						<li>&iquest;Ya lo ha copiado todo? Si no ha hecho la copia de seguridad, por favor, vuelva al punto anterior y h&aacute;gala.</li>
						<li>Copie sus actuales <b>.htaccess</b> y <b>config.php</b>, y guardelos en un sitio seguro.</li>
						<li>Compruebe de nuevo que su copia de seguridad es correcta y est&aacute; guardada en un sitio seguro. <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" /></li>
						<li>Descomprima el paquete de Icy Phoenix en un directorio de su disco duro.</li>
						<li>Suba la carpeta <b>install</b> a la ra&iacute;z de su Icy Phoenix, y ejecute el <b>database_update.php</b> (ej: <a class="post-url" href="http://www.miweb.com/foro/install/database_update.php">http://www.miweb.com/foro/install/database_update.php</a>). Por favor recuerde que si la carpeta <b>install/</b> no est&aacute; en la ra&iacute;z de su foro, la actualizaci&oacute;n no funcionar&aacute; correctamente.</li>
						<li>Borre la carpeta <b>install</b>.</li>
						<li>Mueva los siguientes directorios:
							<ul>
								<li><b>album_mod/upload/*.*</b> ==> <b>/files/album/*.*</b></li>
								<li><b>pafiledb/uploads/*.*</b> ==> <b>/downloads/*.*</b></li>
							</ul>
						</li>
						<li>Borre los siguientes directorios (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar del phpBB XS, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />):
							<ul>
								<li><b>adm/</b></li>
								<li><b>album_mod/</b></li>
								<li><b>attach_mod/</b></li>
								<li><b>bb_usage_stats/</b></li>
								<li><b>captcha/</b></li>
								<li><b>ctracker/</b></li>
								<li><b>db/</b></li>
								<li><b>docs/</b></li>
								<li><b>errors/</b></li>
								<li><b>hl/</b></li>
								<li><b>includes/</b></li>
								<li><b>language/</b></li>
								<li><b>mo/</b></li>
								<li><b>mods/</b></li>
								<li><b>stat_modules/</b></li>
								<li><b>templates/</b></li>
								<li><b>xs_mod/</b></li>
							</ul>
						</li>
						<li>Borre <b>todos los archivos, </b>pero mantenga el <b>config.php</b> en la ra&iacute;z de su foro (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />).</li>
						<li>Suba todos los archivos de Icy Phoenix (todo menos <b>config.php</b>) en el mismo directorio donde tenia instalado y funcionando su phpBB XS. Compruebe que todos los archivos viejos son sobrescritos, en su caso,  por los nuevos.</li>
						<li>Aplique todos los permisos CHMOD listados en la <a class="post-url" href="#fresh_installation">Instalaci&oacute;n Nueva</a>.</li>
						<li>Mofifique lo que necesite para personalizar los campos y la base de datos (algunos archivos necesitan ser editados manualmente, pero  la mayor parte de las opciones pueden ser configuradas a trav&eacute;s del ACP y CMS).</li>
						<li>Abra su web.</li>
						<li>Disfrute de su nueva web <b>Icy Phoenix</b> <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Disfrute!" title="Disfrute!" />.</li>
					</ol>
					<br />
				</div>
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="upgrade_ip_015">Actualizaci&oacute;n desde Icy Phoenix 1.1.0.15</a></span></td>
		</tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					Si est&aacute; utilizando Icy Phoenix 1.1.0.15, puede actualizar su web siguiendo estas instrucciones:<br />
					<ol type="1">
						<li>Identifiquese como Administrador.</li>
						<li>Cierre su web.</li>
						<li><strong><span class="text_red">Haga una copia de seguridad completa de los archivos y la base de datos</span></strong> (&iexcl;si no  hace una copia de seguridad, no se atreva a pedir ayuda luego! <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />)</li>
						<li>&iquest;Ya lo ha copiado todo? Si no ha hecho la copia de seguridad, por favor, vuelva al punto anterior y h&aacute;gala.</li>
						<li>Copie sus actuales <b>.htaccess</b>, <b>config.php</b>, y guardelos en un sitio seguro.</li>
						<li>Compruebe de nuevo que su copia de seguridad es correcta y est&aacute; guardada en un sitio seguro. <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" /></li>
						<li>Descomprima el paquete de Icy Phoenix en un directorio de su Disco Duro.</li>
						<li>Suba la carpeta <b>install</b> a la ra&iacute;z de su Icy Phoenix, y ejecute el <b>database_update.php</b> (ej: <a class="post-url" href="http://www.miweb.com/foro/install/database_update.php">http://www.miweb.com/foro/install/database_update.php</a>). Por favor recuerde que si la carpeta <b>install/</b> no est&aacute; en la ra&iacute;z de su foro, la actualizaci&oacute;n no funcionar&aacute; correctamente.</li>
						<li>Mueva los siguientes directorios:
							<ul>
								<li><b>pafiledb/uploads/*.*</b> ==> <b>/downloads/*.*</b></li>
							</ul>
						</li>
						<li>Borre los siguientes directorios (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar del Icy Phoenix, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />):
							<ul>
								<li><b>adm/</b></li>
								<li><b>includes/</b></li>
								<li><b>language/</b></li>
								<li><b>templates/</b></li>
							</ul>
						</li>
						<li>Borre <b>todos los archivos, </b>pero mantenga el <b>config.php</b> en la ra&iacute;z de su foro (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />).</li>
						<li>Suba todos los archivos de Icy Phoenix (todo menos <b>config.php</b>) en el mismo directorio donde tenia instalado y funcionando su Icy Phoenix. Compruebe que todos los archivos viejos son sobrescritos, en su caso,  por los nuevos.</li>
						<li>Aplique todos los permisos CHMOD listados en la <a class="post-url" href="#fresh_installation">Instalaci&oacute;n Nueva</a>.</li>
						<li>Mofifique lo que necesite para personalizar los campos y la base de datos (algunos archivos necesitan ser editados manualmente, pero  la mayor parte de las opciones pueden ser configuradas a trav&eacute;s del ACP y CMS).</li>
							<ul>
								<li><b>common.php</b></li>
								<li><b>config.php</b></li>
								<li><b>includes/constants.php</b></li>
								<li><b>language/lang_***/lang_main_settings.php</b></li>
							</ul>
						</li>
						<li>Ejecute <b>install/install.php</b> y complete la actualizaci&oacute;n renombrando y moviendo las imagenes (enviadas al Album) y reemplazando todos los enlaces de los mensajes: el procedimiento automatizado debe ser capaz de llevar a cabo todas estas acciones autom&aacute;ticamente, siga las instrucciones</li>
						<li>Borre la carpeta <b>install</b>.</li>
						<li>Abra su web.</li>
						<li>Disfrute de su nueva web <b>Icy Phoenix</b> <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Disfrute!" title="Disfrute!" />.</li>
					</ol>
					<br />
				</div>
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="upgrade_ip">Actualizaci&oacute;n desde IP 1.2.0.27</a></span></td>
		</tr>
		<tr>
			<td class="row-post" colspan="3">
				<div class="post-text">
					<br />
					Si est&aacute; utilizando Icy Phoenix 1.2.0.27 o superior, puede actualizar su web siguiendo estas instrucciones:<br />
					<ol type="1">
						<li>Identifiquese como Administrador.</li>
						<li>Cierre su web.</li>
						<li><strong><span class="text_red">Haga una copia de seguridad completa de los archivos y la base de datos</span></strong> (&iexcl;si no  hace una copia de seguridad, no se atreva a pedir ayuda luego! <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />)</li>
						<li>&iquest;Ya lo ha copiado todo? Si no ha hecho la copia de seguridad, por favor, vuelva al punto anterior y h&aacute;gala.</li>
						<li>Copie sus actuales <b>.htaccess</b> (si lo a editado), y <b>config.php</b>, y guardelos en un sitio seguro.</li>
						<li>Copie sus paginas personalizadas que ha creado con CMS (si las a creado).</li>
						<li>Compruebe de nuevo que su copia de seguridad es correcta y est&aacute; guardada en un sitio seguro. <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" /></li>
						<li>Descomprima el paquete de Icy Phoenix en un directorio de su Disco Duro.</li>
						<li>Suba la carpeta <b>install</b> a la ra&iacute;z de su Icy Phoenix, y ejecute el <b>database_update.php</b> (ej: <a class="post-url" href="http://www.miweb.com/foro/install/database_update.php">http://www.miweb.com/foro/install/database_update.php</a>). Por favor recuerde que si la carpeta <b>install/</b> no est&aacute; en la ra&iacute;z de su foro, la actualizaci&oacute;n no funcionar&aacute; correctamente.</li>
						<li>Mueva los siguientes directorios:
							<ul>
								<li><b>pafiledb/uploads/*.*</b> ==> <b>/downloads/*.*</b></li>
							</ul>
						</li>
						<li>Borre los siguientes directorios (aseg&uacute;rese de que en estas carpetas no tenga algunos archivos que pueda necesitar del Icy Phoenix, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />):
							<ul>
								<li><b>adm/</b></li>
								<li><b>includes/</b></li>
								<li><b>language/</b></li>
								<li><b>templates/</b></li>
							</ul>
						</li>
						<li>Borre <b>todos los archivos</b> pero mantenga el <b>config.php</b> en la ra&iacute;z de su foro (asegurese de que en estas carpetas no tenga algunos archivos que pueda necesitar, pero en cualquier caso ya tiene una copia de seguridad... <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Normas de Backup!" title="Normas de Backup!" />).</li>
						<li>Suba todos los archivos de Icy Phoenix (todo menos <b>config.php</b>) en el mismo directorio donde tenia instalado y funcionando su phpBB XS. Compruebe que todos los archivos viejos son sobrescritos, en su caso,  por los nuevos.</li>
						<li>Aplique todos los permisos CHMOD listados en la <a class="post-url" href="#fresh_installation">Instalaci&oacute;n Nueva</a>.</li>
						<li>Modifique lo que necesite para personalizar los campos y la base de datos (algunos archivos necesitan ser editados manualmente, pero  la mayor parte de las opciones pueden ser configuradas a trav&eacute;s del ACP y CMS).</li>
							<ul>
								<li><b>common.php</b></li>
								<li><b>config.php</b></li>
								<li><b>includes/constants.php</b></li>
								<li><b>language/lang_***/lang_main_settings.php</b></li>
							</ul>
						</li>
						<li>Ejecute <b>install/install.php</b> y complete la actualizaci&oacute;n renombrando y moviendo las imagenes (enviadas al Album) y reemplazando todos los enlaces de los mensajes: el procedimiento automatizado debe ser capaz de llevar a cabo todas estas acciones autom&aacute;ticamente, siga las instrucciones</li>
						<li>Borre la carpeta <b>install</b>.</li>
						<li>Abra su web.</li>
						<li>Disfrute de su nueva web <b>Icy Phoenix</b> <img src="../images/smiles/icon_mrgreen.gif" alt="&iexcl;Disfrute!" title="Disfrute!" />.</li>
					</ol>
					<br />
				</div>
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>

		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="support">Soporte</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<br />
				<div class="post-text">Para cualquier petici&oacute;n o pregunta, por favor, dir&iacute;jase a <a class="post-url" target="_blank" href="http://www.icyphoenix.com">www.icyphoenix.com</a>.</div>
				<br />
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Top</a>&nbsp;&nbsp;</span></td></tr>
		</table>


		<table class="forumline" width="100%" cellspacing="0" cellpadding="0">
		<tr><td class="row-header" colspan="3"><span><a name="history">Historial</a></span></td></tr>
		<tr>
			<td class="row-post" colspan="3">
				<br />
				<div class="post-text">
					<br />
					<i>Versi&oacute;n 1.1.0.15 (20/05/2007)</i>
					<ul><li>Primer lanzamiento oficial.</li></ul>
					<br />
					<br />
					<i>Versi&oacute;n 1.2.0.27 (03/03/2008)</i>
					<ul><li>Segundo lanzamiento oficial.</li></ul>
					<br />
					<br />
					<i>Version 1.3.0.53 (2009/07/17)</i>
					<ul><li>Tercer lanzamiento estable.</li></ul>
					<br />
				</div>
				<br />
			</td>
		</tr>
		<tr><td class="cat" colspan="3"><span style="float: right;">&nbsp;&nbsp;<a href="#top" class="gensmall">Arriba</a>&nbsp;&nbsp;</span></td></tr>
		</table>

<!-- CONTENT END -->
	</td>
</tr>
<tr>
	<td width="100%" colspan="3">
	<div id="bottom_logo_ext">
	<div id="bottom_logo">
		<table class="empty-table" width="100%" cellspacing="0" cellpadding="0" border="0">
			<tr>
				<td nowrap="nowrap" width="45%" align="left">
					<span class="copyright">&nbsp;Funciona con <a href="http://www.icyphoenix.com/" target="_blank">Icy Phoenix</a> basado en <a href="http://www.phpbb.com/" target="_blank">phpBB</a><br /> &nbsp; Traducci&oacute;n al Espa&ntilde;ol por <a href="http://www.icyphoenix.es/" target="_blank">Icy Phoenix Espa&ntilde;a</a></span><br />
				</td>
				<td nowrap="nowrap" align="center"><div style="text-align:center;">&nbsp;</div></td>
				<td nowrap="nowrap" width="45%" align="right">
					<br /><span class="copyright">Dise&ntilde;o por <a href="http://www.mightygorgon.com" target="_blank">Mighty Gorgon</a>&nbsp;</span><br /><br />
				</td>
			</tr>
		</table>
	</div>
	</div>
	</td>
</tr>
</table>
</div></div></div>
</div>
<a name="bottom"></a>
</body>
</html>